<?php

namespace Database\Seeders;

use App\Models\Menu;
use Illuminate\Database\Seeder;
use Illuminate\Support\Str;

class MenuSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Menu::truncate();

        $data = [
            'Інформація про заклад' => [
                'Історія закладу освіти',
                'Адміністрація',
                'Педагогічний колектив',
            ],
            'Прозорість та інформаційна відкритість закладу освіти' => [
                'Cтатут закладу освіти',
                'Ліцензії на провадження освітньої діяльності',
                'Структура та органи управління закладу освіти',
                'Кадровий склад закладу освіти згідно з ліцензійними умовами',
                'Освітні програми, що реалізуються в закладі освіти',
                'Територія обслуговування, закріплена за закладом освіти',
                'Ліцензований обсяг та фактична кількість осіб, які навчаються у закладі освіти',
                'Мова (мови) освітнього процесу',
                'Наявність вакантних посад, порядок і умови проведення конкурсу на їх заміщення',
                'Матеріально-технічне забезпечення закладу освіти',
                'Результати моніторингу якості освіти',
                'Річний звіт про діяльність закладу освіти',
                'Правила прийому до закладу освіти',
                'Умови доступності закладу освіти для осіб з особливими освітніми потребами',
                'Перелік додаткових освітніх та інших послуг',
                'Кошторис та фінансова звітність',
            ],
            'Освітній процес' => [
                'Структура навчального року',
                'Методичні рекомендації щодо організації освітнього процесу',
                'Дистанційне навчання',
                'Екстернатне навчання',
                'ДПА/ЗНО/НМТ',
                'Академічна доброчесність',
                'Стратегія розвитку закладу освіти',
                'Нормативно-правове забезпечення освітнього процесу',
                'Олімпіади та конкурси',
                'Атестація педагогічних працівників',
            ],
            'Методична робота' => [
                'Структура методичної роботи',
                'Шкільні методичні об’єднання',
                'Предметні тижні та декади',
                'Методичні рекомендації щодо викладання предметів навчального плану',
                'Модельні навчальні програми',
                'Державні стандарти загальної середньої освіти',
                'Підвищення фахової майстерності',
            ],
            'Безпечене освітнє середовище' => [
                'Стоп булінг',
                'Мінна безпека',
                'Безпека в Інтернеті',
                'Безпека дорожнього руху',
                'Безпека життєдіяльності',
            ],
            'Система оцінювання здобувачів освіти' => [
                'Критерії оцінювання навчальних досягнень',
                'Моніторинг освітнього процесу',
                'Положення про внутрішню систему забезпечення якості освіти',
            ],
            'Виховна робота' => [
                'Структура виховної роботи',
                'Національно-патріотичне виховання',
                'Виховні заходи',
                'Учнівське самоврядування',
                'Акції',
                'Екскурсії',
            ],
            'Цивільний Захист' => [
                'Нормативно-правові документи',
                'Пожежна безпека',
                'Небезпека соціального характеру',
                'Небезпека техногенного характеру',
                'Небезпека природнього характеру',
                'Алгоритми дій у надзвичайних ситуаціях',
                'День Цивільного Захисту',
            ],
            'Охорона праці та безпека життєдіяльності' => [
                'Нормативно-правові документи',
                'Інструкції з ОП та БЖ для працівників закладу освіти',
                'Інструкції з ОП та БЖ для здобувачів освіти',
                'Інструкції з ОП та БЖ для приміщень підвищеної небезпеки',
            ],
            'Нова Українська Школа' => [
                'Концепція НУШ',
                'Варіативні модулі змістового наповнення предметів «Фізична культура» та «Технології»',
                'Новини НУШ',
            ],
            'Здобувачам освіти' => [
                'Розклад уроків',
                'Розклад дзвінків',
                'Готуємося до ДПА/ЗНО/НМТ',
            ],
            'Батькам' => [
                'Правила прийому до закладу освіти',
                'Графік особистого прийому громадян адміністрацією закладу',
                'Практичні поради батькам',
            ],
            'Бібліотека' => [
                'Електронні версії підручників',
                'Результати вибору підручників',
            ],
            'Психологічна служба' => [
                'Протидія домашньому насиллю',
                'Ментальне здоров’я',
                'Психологічна підтримка учасників освітнього процесу',
            ],
            'Оголошення' => [],
        ];

        foreach ($data as $parentTitle => $children) {
            $parent = Menu::create([
                'title' => $parentTitle,
                'slug'  => Str::slug($parentTitle),
            ]);

            if (!empty($children)) {
                foreach ($children as $childTitle) {
                    $parent->children()->create([
                        'title' => $childTitle,
                        'slug'  => Str::slug($childTitle),
                    ]);
                }
            }
        }
    }
}
